testCases/heatTransfer/testHT3/0.org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    sides
    {
        type            zeroGradient;
    }

    top
    {
        type            waveTransmissive;
        gamma           1.4;
        fieldInf        uniform 1e5;
    }

    bottom
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type            symmetryPlane;
    }
}


// ************************************************************************* //
